1) /Users/davide/Projects/domain-events/src/Registry/EventsRegistry.php:20    [M] IdenticalEqual

--- Original
+++ New
@@ @@
      */
     public function expelRecordedEvents() : array
     {
-        if ($this instanceof EventAware === false) {
+        if ($this instanceof EventAware == false) {
             throw IncompatibleClass::forExpellingEvents($this);
         }
         $recordedEvents = $this->recordedEvents;
